CFD_outputData/case_02/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{	
	
	CRAHinlet
    {
        type            fixedValue;
        value			uniform (0 -0.678 0);
    }
    CRAHoutlet
    {
        type            fixedValue;
        value			uniform (-0.678 0 0);
    }
    wall
    {
        type            noSlip;
    }
    cab_inlet-z
    {
        type            fixedValue;
		value			uniform (0 0 -0.5844);
    }
    cab_inlet+z
    {
        type            fixedValue;
		value			uniform (0 0 0.5844);
    }
    cab_outlet-z
    {
        type            fixedValue;
		value			uniform (0 0 -0.5844);
    }
    cab_outlet+z
    {
        type            fixedValue;
		value			uniform (0 0 0.5844);
    }
}

// ************************************************************************* //
