CFD_outputData/case_02/0/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;	//2.3039e-5

boundaryField
{
	
	CRAHinlet
    {
        type            fixedValue;
		value			$internalField;
    }
    CRAHoutlet
    {
        type            zeroGradient;
    }
    wall
    {
        type            alphatJayatillekeWallFunction;
        Prt             0.71;
        value           $internalField;
    }
    cab_inlet-z
    {
        type            alphatJayatillekeWallFunction;
        Prt             0.71;
        value           $internalField;
    }
    cab_inlet+z
    {
        type            alphatJayatillekeWallFunction;
        Prt             0.71;
        value           $internalField;
    }
    cab_outlet-z
    {
        type            zeroGradient;
    }
    cab_outlet+z
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
